import { links } from '~/data/common'

export const contacts = {
  title: 'Контакты',
  subtitle: 'Сделай первый шаг — остальное покажем на танцполе 💃',
  note: 'Здесь каждый шаг — маленькая победа, а каждый танец — радость для души!',
  cta: {
    title: 'Остались вопросы?',
    subtitle: 'Свяжитесь с нами — мы всегда на связи 🤍',
    buttons: [
      {
        id: 1,
        text: 'Написать',
        icon: 'mingcute:telegram-fill',
        link: links.telegram,
      },
      {
        id: 2,
        text: 'Позвонить',
        icon: 'line-md:phone-filled',
        link: links.telegram,
      },
    ],
  },
}
