import { links } from '~/data/common'
import TwoGisIcon from '~/assets/images/icons/2gis.svg'
import GirlOneImage from '~/assets/images/girl1.webp'
import GirlTwoImage from '~/assets/images/girl2.webp'
import GirlThreeImage from '~/assets/images/girl3.webp'

export const feedback = {
  title: 'Отзывы',
  subtitle: 'Когда глаза детей сияют — это и есть наш лучший отзыв ✨',
  reviews: [
    {
      id: 1,
      author: 'Виктория Д.',
      text: 'Самая лучшая студия танцев! Вместе с прекрасным коллективом уже 7 лет. Талантливые педагоги дают от основ хореографии до потрясающе эффектных, крутых, уникальных постановок танцев!',
      img: GirlOneImage,
    },
    {
      id: 2,
      author: 'Екатерина К.',
      text: 'Любимая студия уже много лет! Много различных направлений и для детей, и для их родителей! Душевная обстановка! Обожаем Смузи😇',
      img: GirlTwoImage,
    },
    {
      id: 3,
      author: 'Лариса Е.',
      text: 'Занимаемся танцами с 4-х лет, сейчас уже 12. Завоевали много наград и в основном только призовые места. Дети гордятся своими достижениями, любят и очень уважают своих педагогов.',
      img: GirlThreeImage,
    },
  ],
  links: [
    {
      id: 1,
      icon: 'material-symbols:location-on',
      text: 'Яндекс',
      link: links.yandex,
    },
    {
      id: 2,
      icon: 'ri:google-fill',
      text: 'Google',
      link: links.google,
    },
    {
      id: 3,
      customIcon: TwoGisIcon,
      text: '2GIS',
      link: links.twogis,
    },
  ],
}
