import acrobatics from '~/assets/images/icons/acrobatics.webp'
import building from '~/assets/images/icons/building.webp'
import friendship from '~/assets/images/icons/friendship.webp'
import mic from '~/assets/images/icons/mic.webp'
import teddy from '~/assets/images/icons/teddy.webp'
import theater from '~/assets/images/icons/theater.webp'

export const why = {
    title: "Почему мы",
    subtitle: "В SMUZI DANCE дети учатся двигаться под музыку, верить в себя и кайфовать от процесса 💚 Наши педагоги — настоящие фанаты танца и умеют зажечь даже самых стеснительных!",
    note: "Мы верим, что танец — это не просто движение. Это способ раскрыть личность, научиться слышать своё тело и радоваться каждому шагу. Наши педагоги создают атмосферу поддержки и вдохновения для каждого ребёнка.",
    cards: [
        {
            icon: building,
            title: "Просторные залы",
            subtitle: "Комфортные раздевалки, охрана и парковка для родителей"
        },
        {
            icon: acrobatics,
            title: "Студия акробатики и брейк-данса",
            subtitle: "От 4 лет, помогает развивать координацию и силу"
        },
        {
            icon: teddy,
            title: "Для малышей от 3 лет",
            subtitle: "Берём детей без подготовки — всё через игру и движение"
        },
        {
            icon: theater,
            title: "Уникальные постановки",
            subtitle: "Каждый номер — маленькое художественное произведение"
        },
        {
            icon: mic,
            title: "Фестивали и концерты",
            subtitle: "Регулярно выступаем на сценах и конкурсах"
        },
        {
            icon: friendship,
            title: "Дружелюбная атмосфера",
            subtitle: "Ребята находят друзей и уверенность на паркете"
        }
    ]
}
